niekiran/MasteringMCU2/Source_codes/STM32CubeIDE/MasteringMCU2/HSE_SYSCLK_8Mhz/Core/Src/main_app.c
/*
 * main.c
 *
 *  Created on: 02-Jun-2018
 *      Author: kiran
 */

/* Includes ------------------------------------------------------------------*/
#include <string.h>
#include <stdio.h>
#include "stm32f4xx_hal.h"
#include "main_app.h"

/* Private define ------------------------------------------------------------*/
#define TRUE    1
#define FALSE   0

/* Private function prototypes -----------------------------------------------*/
void UART2_Init(void);
void Error_handler(void);

/* Private variables ---------------------------------------------------------*/
UART_HandleTypeDef huart2;

int main(void)
{
  RCC_OscInitTypeDef osc_init;
  RCC_ClkInitTypeDef clk_init;
  char msg[100];
  HAL_Init();
  UART2_Init();

  memset(&osc_init,0,sizeof(osc_init));
  osc_init.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  osc_init.HSEState = RCC_HSE_BYPASS;
  if ( HAL_RCC_OscConfig(&osc_init) != HAL_OK)
  {
    Error_handler();
  }

  clk_init.ClockType = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK  | \
                       RCC_CLOCKTYPE_PCLK1  | RCC_CLOCKTYPE_PCLK2;
  clk_init.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
  clk_init.AHBCLKDivider = RCC_SYSCLK_DIV2;
  clk_init.APB1CLKDivider = RCC_HCLK_DIV2;
  clk_init.APB2CLKDivider = RCC_HCLK_DIV2;

  if( HAL_RCC_ClockConfig(&clk_init, FLASH_ACR_LATENCY_0WS) != HAL_OK)
  {
    Error_handler();
  }

  /*---------------------------- AFTER THIS LINE SYSCLK is SOURCED BY HSE------------------*/

  __HAL_RCC_HSI_DISABLE(); //Saves some current

  /* LETS REDO THE SYSTICK CONFIGURATION */

  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  UART2_Init();

  memset(msg,0,sizeof(msg));
  sprintf(msg,"SYSCLK : %ldHz\r\n",HAL_RCC_GetSysClockFreq());
  HAL_UART_Transmit(&huart2,(uint8_t*)msg,strlen(msg),HAL_MAX_DELAY);

  memset(msg,0,sizeof(msg));
  sprintf(msg,"HCLK   : %ldHz\r\n",HAL_RCC_GetHCLKFreq());
  HAL_UART_Transmit(&huart2,(uint8_t*)msg,strlen(msg),HAL_MAX_DELAY);

  memset(msg,0,sizeof(msg));
  sprintf(msg,"PCLK1  : %ldHz\r\n",HAL_RCC_GetPCLK1Freq());
  HAL_UART_Transmit(&huart2,(uint8_t*)msg,strlen(msg),HAL_MAX_DELAY);

  memset(msg,0,sizeof(msg));
  sprintf(msg,"PCLK2  : %ldHz\r\n",HAL_RCC_GetPCLK2Freq());
  HAL_UART_Transmit(&huart2,(uint8_t*)msg,strlen(msg),HAL_MAX_DELAY);

  while(1);

  return 0;
}

/**
  * @brief USART2 Initialization Function
  * @param None
  * @retval None
  */
void UART2_Init(void)
{
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  if ( HAL_UART_Init(&huart2) != HAL_OK )
  {
    //There is a problem
    Error_handler();
  }
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_handler(void)
{
  while(1);
}

